package com.pretask;

public class VariableAssignment {
  public static void main(String[] args) {
    // - класс VariableAssignment, объявите целочисленную переменную и присвойте ей значение.
    // Выведите значение на экран;
    int myVar = 5;
    System.out.println(myVar);
  }
}
